



import '../model/category.dart';
import '../model/quotes.dart';

List<Category> categories = [
  Category(
    id: '1',
    name: 'اقتباسات حب',
    image: '',
    quotes: [
      Quotes(id: '1',text: 'ffffffffffffff' ),
      Quotes(id: '2',  text: 'fffffffffff'),
      Quotes(id: '3', text: 'ffffffffff' ),
    ],
  ),

   Category(
    id: '2',
    name: 'اقتباسات منوعة',
    image: '',
    quotes: [
      Quotes(id: '1',text: 'mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm' ),
      Quotes(id: '2',  text: 'mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm'),
      Quotes(id: '3', text: 'mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm' ),
    ],
  ),

  Category(
    id: '3',
    name: 'ادعيه',
    image: '',
    quotes: [
       Quotes(id: '1',text: 'يؤلمني الشك في صِدق الذكريات. تخيل أن تعيش أمورًا تؤمن بكل ما فيك أنها الأصدق والأبقى، لكنك وبعد مرور الأيام الموحشة والغريبة عليك، يُصيبك الشك في صدق كل الذي كان عمرًا كاملًا بالنسبة لك.' ),
      Quotes(id: '2',  text: 'في الطريق لمن تُحب، لا تعرج القدم المُصابة؛ بل ترقُص.^'),
      Quotes(id: '3', text: ' توضأ ، ضع يدك على صدرك وقُل : ”يا رب ، إني لا أملك من أمر الدنيا شيء ، وإني وكّلتك أمري كله ، جله ودقه أوله وآخره علانيته وسره ، فتولَّاه بعنايتك ، واجعلني دائم الرضا كثير الشكر حَسَن الطبع.”' ),
      Quotes(id: '4', text: '  الأصدق والأبقى، لكنك وبعد مرور الأيام الموحشة والغريبة عليك، يُصيبك الشك في صدق كل الذي كان عمرًا كاملًا بالنسبة    الأصدق والأبقى، لكنك وبعد مرور الأيام الموحشة والغريبة عليك، يُصيبك الشك في صدق كل الذي كان عمرًا كاملًا بالنسبة  الأصدق والأبقى، لكنك وبعد مرور الأيام الموحشة والغريبة عليك، يُصيبك الشك في صدق كل الذي كان عمرًا كاملًا بالنسبة توضأ ، ضع يدك على صدرك وقُل : ”يا رب ، إني لا أملك من أمر الدنيا شيء ، وإني وكّلتك أمري كله ، جله ودقه أوله وآخره علانيته وسره ، فتولَّاه بعنايتك ، واجعلني دائم الرضا كثير الشكر حَسَن الطبع.”' ),
      Quotes(id: '5', text: 'محمد  اااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااااا لالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالالا رامي ' ),

    ],
  ),
  
];
